class Scene_Base
  #--------------------------------------------------------------------------
  # * Processamento principal
  #--------------------------------------------------------------------------
  def main
    start
    update until scene_changing?
    terminate
  end

  #--------------------------------------------------------------------------
  # * Inicialização do processo
  #--------------------------------------------------------------------------
  def start
    @framesCounter = 0
  end

  #--------------------------------------------------------------------------
  # * Definição de mudança de cenas
  #--------------------------------------------------------------------------
  def scene_changing?
    SceneManager.scene != self
  end

  #--------------------------------------------------------------------------
  # * Atualização da tela
  #--------------------------------------------------------------------------
  def update
    BeginDrawing()
    ClearBackground(BLACK)
    update_basic
    EndDrawing()
    SceneManager.exit if IsKeyPressed(KEY_ESCAPE)
  end

  #--------------------------------------------------------------------------
  # * Atualização da tela (básico)
  #--------------------------------------------------------------------------
  def update_basic
    @framesCounter += 1
  end

  def terminate
  end

  #--------------------------------------------------------------------------
  # * Finalização do processo
  #--------------------------------------------------------------------------
  def dispose
  end

  #--------------------------------------------------------------------------
  # * Chamada de retorno de cena
  #--------------------------------------------------------------------------
  def return_scene
    SceneManager.return
  end
end
